#include<stdio.h>
#include <string.h>
#include<stdlib.h>
#include<math.h>

// 浮点型在内存中如何存储
// int main(){
//     double d = 1E10;
//     printf("%lf",d)
// }

// int main(){
//     int n = 9;
//     float *pFloat = (float *)&n;
//     printf("n的值为:%d\n",n);
//     printf("pFloat的值为:%f\n", *pFloat);

//     *pFloat = 9.0;
//     printf("num的值为:%d\n",n);
//     printf("pFloat的值为:%f\n", *pFloat);
// }

    // float 32个bit位
    // s(1bit) E(8bit) M(23bit)

    // double 64个bit位
    // s(1bit) E(11bit) M(52bit)

    // 存入
    // 5.5
    // 101.1
    // (-1)^0 * 1.011 * 2^2
    // (-1)^S * M     * 2^E
    // S = 0
    // M = 1.011
    // E = 2
    // 0 E+127     M
    // 0 10000001  011 00000000000000000000
    // 01000000101100000000000000000000
    // 0100 0000 1011 0000 0000 0000 0000 0000
    // 40    00   b0  00   00    00   00   00
    // 0x4000b00000 即存入0x4000b00000

    // 取出
    // 1. 当E不全为0或者不全为1 如上面
    // 用E的存储值减去127为真实值，如上面：10000001 = 129 ；129-127 = 2 ，即E=2
    // float 减去127；double 减去1023
    // M则要添上去掉的1 如上面011，添上则为1.011
    
    // 2. E全为0 即00000000 = E +127,说明E为-127
    // 2^(-127)是一个非常小的数，几乎接近于0
    // 因此规定E为(1-127)即为真实值，M不+1，
    // 还愿成0.xxxxxxx的小数
    // 如：0 00000000 011 00000000000000000000
    //  (-1)^0 * 0.011 * 2^(126 = 1-127)

    // 3. E全为1 即11111111 = E +127,说明E为128
    // 2^(128)是一个非常大的数
    // 如 0 00000000 011 00000000000000000000
    //  (-1)^0 * 0.011 * 2^128  

// int main(){
//     int n = 9;
//     //  存入 0 0000000000000000000000000001001 -补码 
//     float *pFloat = (float *)&n;
//     printf("n的值为:%d\n",n);//9
//     // 0 0000000000000000000000000001001 -补码 
//     // 即 打印结果是9
//     printf("pFloat的值为:%f\n", *pFloat);//0.000000
//     // 0 00000000 00000000000000000001001 - 浮点数
//     // (-1)^0 * 0.00000000000000000001001 * 2^(-126)
//     // 所以打印结果是0.000000

//     *pFloat = 9.0;
//     // 1001.0  1.001*2^3
//     // (-1)^0 * 1.001 * 2^3
//     // S:0  E=127+3    去小数点前面的1  再补足23个bit位  
//     // 0    10000010   001            00000000000000000000
//     // 9.0即存入 01000001000100000000000000000000
//     printf("num的值为:%d\n",n);// 1091567616
//     // 因为打印的是整数，即01000001000100000000000000000000 为补码
//     // 01000001000100000000000000000000 转为十进制为 1,091,567,616
//     printf("pFloat的值为:%f\n", *pFloat);//9.000000
// }

// 字符指针
// int main(){
//    char ch = 'w';
//    char* pc = &ch; // 字符指针
// }
// int main(){
//     char arr[] = "abcdef";
//     char* pc = arr;
//     printf("这个是arr:%s\n",arr);
//     printf("这个是pc:%s\n",pc);
//     return 0;
// }
// int main(){
//     // "abcdef" 是一个常量字符串
//     // char* p = "abcdef"; 
//     const char* p = "abcdef"; // 最好这样写
//     // *p == 'O'; // 不能这样写
//     // printf("%c\n",*p); // 即p里面存的是a的地址，打印结果是a
//     // %c 打印一个字符  %s打印一个字符串
//     printf("%s\n",p); //abcdef
//     // *p是解引用常量，它是char类型，访问一个字节的大小
//     return 0;
// }

// int main(){
//     char arr1[] = "abcdef";
//     char arr2[] = "abcdef";
//     char* p1 = "abcdef"; // 常量字符串
//     char* p2 = "abcdef";
//     // if(arr1 == arr2){ 
//     //     printf("hehe\n");
//     // }
//     // else{
//     //     printf("haha\n");//arr是首元素地址名，所以不一样
//     // }
//     if(p1 == p2){ 
//         printf("hehe\n");
//         // 因为两个指针中指向的内容是相同的
//         // 此时abcdef赋值给的是一个指针变量,给的是地址,
//         // abcdef在静态内存里是一个字符常量,
//         // 当然给的是一个地址
//     }
//     else{
//         printf("haha\n");
//     }
// }

// 指针数组  是数组,用来存放指针的

// int main(){
//     int arr[10] = {0};
//     char arr1[5] = {0};
//     int* parr[4];//存放整型指针的数组，简称指针数组
//     char* pch[4];//存放字符指针的数组，也是指针数组
// }

// int main(){
//     int a = 10;
//     int b = 20;
//     int c = 30;
//     int d = 40;
//     int* arr1[4] = {&a,&b,&c,&d};
//     int i = 0;
//     for(i=0;i<4;i++){
//         printf("%d ",*arr1[i]);
//     }
// }

// int main(){
//     int arr1[] = {1,2,3,4,5};
//     int arr2[] = {4,5,6,7,8};
//     int arr3[] = {5,6,7,8,9};
    
//     int* parr[]={arr1,arr2,arr3};
//     int i = 0;
//     for(i = 0;i<3;i++){
//         int j = 0;
//         for(j = 0;j < 5;j++){
//             printf("%d ",*(parr[i]+j));
//         }
//         printf("\n");
//     }
// }

// 数组指针  是指针
// int main(){
//     int* p = NULL;//p是整型指针，是指向整型的指针-可以存放整型的地址
//     char* pc = NULL;// pc是字符指针，指向字符的指针-可以存放字符的地址
//     // int arr[10] = {0};
//     // arr-首元素地址
//     // &arr[0]-也是首元素地址
//     // &arr - 数组的地址

//     int arr[10] = {0,1,2,3,4,5,6,7,8,9};

//     // 数组指针，即指向数组的指针-可以存放数组的地址
//     int (*p)[10] = &arr; // 数组的地址要存起来
//     //上面的p就是数组指针，*p不是解引用
//     return 0；
// }

// int main(){
//     char* arr[5]; 
//     // 把char*当做一种元素类型，即pa指向的数组的元素类型是char*
//     char* (*pa)[5] = &arr
//     return 0;
// }

// int main(){
//     int arr[10] = {0,1,2,3,4,5,6,7,8,9};
//     int (*pa)[10] = &arr;
//     int i = 0;
//     for(i = 0; i<10;i++){
//         // printf("%d ",(*pa)[i]);
//         // printf("%d ",*(*pa+i));
//         printf("%d ",*(arr +i));
//     }
//     return 0;
// }

// 参数是数组
void printf1(int arr[3][5],int x,int y){
    int i,j;
    for(i = 0;i<x;i++){
        for(j=0;j<5;j++){
            printf("%d ", arr[i] [j] );
        }
        printf("\n");
    }
}
// 参数是指针
void printf2(int (*p)[5],int x,int y){
    int i = 0;
    for(i = 0;i<x;i++){
        int j =0;
        for(j = 0; j<y;j++){
            // printf("%d ",*(*(p+i)+j));
              printf("%d ", ( *(p+i) ) [j] );
            //printf("%d ",   arr[i]    [j] );
        }
        printf("\n");
    }   
}
int main(){
    int arr[3][5] = {{1,2,3,4,5},{2,3,4,5,6},{3,4,5,6,7}};
    // printf1(arr,3,5);
    printf2(arr,3,5);
    return 0;
}

// int arr1[5]
// arr1,是一个5个元素的整型数组

// int* arr2[5]
// arr2 是一个数组，数组有5个元素，每个元素的类型都是int*,即arr2是指针数组

// int (*arr3)[5]
// arr3 是一个指针，该指针指向了一个数组，数组有5个元素，每个元素的类型是int,即arr3是数组指针

// int (*arr4[10])[5]
// arr4 是一个数组，该数组有10个元素，每个元素是一个数组指针(每个元素都是指针)，该数组指针指向的数组有5个元素，每个元素是int类型
// 指向 指针数组的 数组指针
